# 索引

In [4]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [5]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['ohio','colorado','utha','new york'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utha        8    9     10    11
new york   12   13     14    15

## 对行索引

### 对行文字索引

In [7]:
data.loc[['ohio','utha']]

      one  two  three  four
ohio    0    1      2     3
utha    8    9     10    11

### 对行数字索引

In [8]:
data.iloc[[1,3]]

          one  two  three  four
colorado    4    5      6     7
new york   12   13     14    15

### 对列文字索引

In [14]:
data[['two','four']]

          two  four
ohio        1     3
colorado    5     7
utha        9    11
new york   13    15

### 对列进行数字索引

In [15]:
data.iloc[:,[1,3]]

          two  four
ohio        1     3
colorado    5     7
utha        9    11
new york   13    15

### 对值进行索引

In [32]:
data.iat[1,1]

5

In [34]:
data.iat[1,1] = 0
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    0      6     7
utha        8    9     10    11
new york   12   13     14    15